EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_llc.h
/*************************************************************************************************************
 * @file    reg_llc.h
 * @version V1.0 
 * @date    2020-06-19
 * @brief   
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/



#ifndef __REG_LLC_H__
#define __REG_LLC_H__


#ifdef __cplusplus
 extern "C" {
#endif




//=====================================================================================================================
// TYPEDEF STRUCT
//=====================================================================================================================
typedef struct
{
    __IM  uint32_t LLC_INT_FLAG;             /* [0x00](RO) */
    __IOM uint32_t LLC_INT_EN;               /* [0x04](RW) */
    __OM  uint32_t LLC_INT_CLR;              /* [0x08](WO) */
    
    __IOM uint32_t LLC_DATA_RATE;            /* [0x0C][RW] */
    __IOM uint32_t LLC_CTRL;                 /* [0x10][RW] */
    __OM  uint32_t LLC_STOP_CTRL;            /* [0x14][WO] */
    
    __OM  uint32_t LLC_TRIG_CTRL;            /* [0x18][WO] */   // Not Confirm with Digital designer

    
    __IOM uint32_t LLC_CLK_RATIO_CFG;        /* [0x1C][RW] */   
    
    __IOM uint32_t LLC_TX_PDU_HEADER;        /* [0x20][RW] */   
    
    __IOM uint32_t LLC_RX_PDU_HEADER;        /* [0x24][RW] */   
    
    __IOM uint32_t LLC_TRX_CHANNEL_CFG;      /* [0x28][RW] */   
    
    __IOM uint32_t LLC_DATA_CHAN_ACCESS_KEY;  /* [0x2C][RW] */ 

    
    __IOM uint32_t LLC_P2G4_DEFAULT_TX_DATA; /* [0x30][RW] */ 

    __IOM uint32_t LLC_BLE_CFG;              /* [0x34][RW] */ 
    
    __IOM uint32_t LLC_BLE_CTRL;             /* [0x38][RW] */ 

    __IOM uint32_t LLC_P2G4_CFG;             /* [0x3C][RW] P2G4 Only */ 
    __IOM uint32_t LLC_P2G4_CTRL;            /* [0x40][RW] P2G4 Only */ 
    __IOM uint32_t LLC_P2G4_CSMA_CFG;        /* [0x44][RW] P2G4 Only */ 
    __OM  uint32_t LLC_P2G4_TRIG_CTRL;       /* [0x48][WO] P2G4 Only */ 
    
    __IOM uint32_t LLC_CRC_INIT_VAL;         /* [0x4C][RW] */ 
    __IOM uint32_t LLC_CRC_CFG;              /* [0x50][RW] */ 
    __IOM uint32_t LLC_CRC_READ_CFG;         /* [0x54][RW] */ 

    
    __IOM uint32_t LLC_SLEEP_PERIOD;           /* [0x58][RW] */ 
    __IOM uint32_t LLC_SLP_ACT_CONVERT_CNT;    /* [0x5C][RW] */ 
    
    __IOM uint32_t LLC_INTV_PERIOD_HI;         /* [0x60][RW] */ 
    __IOM uint32_t LLC_INTV_PERIOD_LO;         /* [0x64][RW] */ 
    
    __IOM uint32_t LLC_INTV_RELOAD_DELTA_HI;   /* [0x68][RW] */ 
    __IOM uint32_t LLC_INTV_RELOAD_DELTA_LO;   /* [0x6C][RW] */ 

    
    __IOM uint32_t LLC_INTV_PERIOD_MAX_HI;     /* [0x70][RW] */ 
    __IOM uint32_t LLC_INTV_PERIOD_MAX_LO;     /* [0x74][RW] */ 

    __IOM uint32_t LLC_INTV_PERIOD_MIN_HI;     /* [0x78][RW] */ 
    __IOM uint32_t LLC_INTV_PERIOD_MIN_LO;     /* [0x7C][RW] */ 

    __IOM uint32_t LLC_IFS_TIME_CFG;           /* [0x80][RW] */ 
    __IOM uint32_t LLC_IFS_WINDOW_CFG;         /* [0x84][RW] */ 

    __IOM uint32_t LLC_LISTEN_BEGIN_HI;        /* [0x88][RW] */ 
    __IOM uint32_t LLC_LISTEN_BEGIN_LO;        /* [0x8C][RW] */

    __IOM uint32_t LLC_LISTEN_END_HI;          /* [0x90][RW] */ 
    __IOM uint32_t LLC_LISTEN_END_LO;          /* [0x94][RW] */

    __IOM uint32_t LLC_RX_STOP_TIME_HI;        /* [0x98][RW] Befor Listen End */   
    __IOM uint32_t LLC_RX_STOP_TIME_LO;        /* [0x9C][RW] Befor Listen End */

    __IOM uint32_t LLC_INTV_PRE_TIME_CFG;      /* [0xA0][RW]  */

    __IOM uint32_t LLC_TRX_STOP_TIME_HI;           /* [0xA4][RW] Before Next Interval */   
    __IOM uint32_t LLC_TRX_STOP_TIME_LO;           /* [0xA8][RW] Before Next Interval */

    
    __IOM uint32_t LLC_IFS_PRE_TIME_CFG;            /* [0xAC][RW]  */

    
    __IOM uint32_t LLC_CCM_PREPARE_TIME_CFG;        /* [0xB0][RW]  */

    __IOM uint32_t LLC_RADIO_TURNON_PRE_TIME_CFG;   /* [0xB4][RW]  */

    __IOM uint32_t LLC_RADIO_TURNOFF_TIME_CFG;      /* [0xB8][RW]  */
    
    __IM uint32_t RESERVED0;                       /* [0xBC][RO]  */
    
    __IOM uint32_t LLC_INTERRUPT_DELAY_CFG;         /* [0xC0][RW]  */

    
    __IOM uint32_t LLC_INIT_ADDR_HI;                /* [0xC4][RW]  Used to check ADV_DIRECT_IND InitA */
    __IOM uint32_t LLC_INIT_ADDR_LO;                /* [0xC8][RW]  */
    __IOM uint32_t LLC_ADV_ADDR_HI;                 /* [0xCC][RW]  Used to check CONN_REQ AdvA */
    __IOM uint32_t LLC_ADV_ADDR_LO;                 /* [0xD0][RW]  */
    __IOM uint32_t LLC_ADV_DIRECT_IND_CFG;          /* [0xD4][RW]  Used to check ADV_DIRECT_IND */

    __IOM uint32_t LLC_DBG_BREAK_POINT;             /* [0xD8][RW]  Used to Debug Purpose */
    __IOM uint32_t LLC_DBG_SEL_POINT;               /* [0xDC][RW]  Used to Debug Purpose */

    
    __IM  uint32_t LTC_WORK_STATE;                  /* [0xE0][RO]  */

    __IM  uint32_t LLC_P2G4_BUSY_FLG;               /* [0xE4][RO] P2G4 Only */

    __IM  uint32_t LLC_TX_EX_ADV_STA;               /* [0xE8][RO]  Used when TX EXT_ADV */
    __IM  uint32_t LLC_TX_UPDATE_STA;               /* [0xEC][RO]   */
    __IM  uint32_t LLC_RX_STA;                      /* [0xF0][RO]   */
    __IM  uint32_t LLC_RX_UPDATE_STA;               /* [0xF4][RO]   */
    
    __IM  uint32_t LLC_RX_HEADER_VAL;               /* [0xF8][RO]   */
    
    __IM  uint32_t LLC_CRC_FLAG;                    /* [0xFC][RO]   */

    __IM  uint32_t LLC_WORK_STA;                    /* [0x100][RO]   */
    
    __IM  uint32_t LLC_RX_NESN;                     /* [0x104][RO]   */
    __IM  uint32_t LLC_RX_SN;                       /* [0x108][RO]   */

    __IM  uint32_t P2G4_LSM_STA;                    /* [0x10C][RO]   */

    
    __IM  uint32_t LLC_INTV_ACT_CNT_HI;              /* [0x110][RO]   */
    __IM  uint32_t LLC_INTV_ACT_CNT_LO;              /* [0x114][RO]   */

    __IM  uint32_t LLC_INTV_ACT_TRIG_CNT_HI;         /* [0x118][RO]   */
    __IM  uint32_t LLC_INTV_ACT_TRIG_CNT_LO;         /* [0x11C][RO]   */

    __IM  uint32_t LLC_IFS_CNT;                      /* [0x120][RO]   */
    __IM  uint32_t LLC_IFS_TRIG_CNT;                 /* [0x124][RO]   */

    __IM  uint32_t LLC_SCH_ACT_CNT_HI;               /* [0x128][RO]   */
    __IM  uint32_t LLC_SCH_ACT_CNT_LO;               /* [0x12C][RO]   */

    __IM  uint32_t LLC_SCH_ACT_TRIG_CNT_HI;          /* [0x130][RO]   */
    __IM  uint32_t LLC_SCH_ACT_TRIG_CNT_LO;          /* [0x134][RO]   */

    __IM  uint32_t LLC_SLEEP_CNT;                    /* [0x138][RO]   */

    __IM  uint32_t LLC_SLEEP_CONVERT_TO_ACT_CNT_HI;  /* [0x13C][RO]   The Value = LLC_SLEEP_CNT x LLC_CLK_RATIO_CFG */  
    __IM  uint32_t LLC_SLEEP_CONVERT_TO_ACT_CNT_LO;  /* [0x140][RO]   The Value = LLC_SLEEP_CNT x LLC_CLK_RATIO_CFG */  

    __IM  uint32_t LLC_ANCHOR_POS_HI;                /* [0x144][RO]    */  
    __IM  uint32_t LLC_ANCHOR_POS_LO;                /* [0x148][RO]    */  

    __IM  uint32_t LLC_SCH_AUXPTR_CNT_HI;            /* [0x14C][RO]    */  
    __IM  uint32_t LLC_SCH_AUXPTR_CNT_LO;            /* [0x150][RO]    */  

} stLLC_CFG_Handle_t,*pstLLC_CFG_Handle_t;



