EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_llc.h
//=====================================================================================================================
// [0x00~0x08] LLC_INT_FLAG(RO) / LLC_INT_EN(RW) / LLC_INT_CLR(WO)
//=====================================================================================================================
#define G24_RX_END_OK_SHIFT                ( 21 )   //  2.4G Only
#define G24_STOP_SHIFT                     ( 20 )   //  2.4G Only
#define G24_RX_DEF_LOST_SHIFT              ( 19 )   //  2.4G Only
#define G24_TX_DEF_DATA_SHIFT              ( 18 )   //  2.4G Only
#define G24_CSMA_TIME_OUT_SHIFT            ( 17 )   //  2.4G Only
#define G24_ADDR_NOT_MATCH_SHIFT           ( 16 )   //  2.4G Only

#define LLC_TX_FAIL_SHIFT                  ( 15 )   // 
#define LLC_RX_END_SHIFT                   ( 14 )   // What deffirence with LLC_RX_END_VLD  [21]
#define LLC_SLEEP_CNT_OVERFLOW_SHIFT       ( 13 )   
#define LLC_RX_LOST_SHIFT                  ( 12 )
#define LLC_RX_CRC_ERRO_SHIFT              ( 11 )
#define LLC_RX_CRC_OK_SHIFT                ( 10 )

#define LLC_TX_END_SHIFT                   ( 9 )
#define LLC_RX_PRE_IFS_SHIFT               ( 8 )
#define LLC_TX_PRE_IFS_SHIFT               ( 7 )


#define LLC_SLEEP_BEGIN_SHIFT              ( 6 )
#define LLC_RELOAD_UNDERFLOW_SHIFT         ( 5 )
#define LLC_RELOAD_OVERFLOW_SHIFT          ( 4 )
#define LLC_LISEN_END_SHIFT                ( 3 )
#define LLC_INTERVAL_END_SHIFT             ( 2 )
#define LLC_RX_PRE_INTERVAL_SHIFT          ( 1 )
#define LLC_TX_PRE_INTERVAL_SHIFT          ( 0 )


typedef enum
{
    G24_INT_RX_END_OK             = ( 0x01 << G24_RX_END_OK_SHIFT ),      // [21]  2.4G Only
    G24_INT_2G4_STOP              = ( 0x01 << G24_RX_END_OK_SHIFT ),      // [20] 2.4G Only
    G24_INT_RX_DEF_LOST           = ( 0x01 << G24_RX_DEF_LOST_SHIFT ),    // [19] 2.4G Only
    G24_INT_TX_DEF_DATA           = ( 0x01 << G24_TX_DEF_DATA_SHIFT ),    // [18]2.4G Only
    G24_INT_CSMA_TIME_OUT         = ( 0x01 << G24_CSMA_TIME_OUT_SHIFT),   // [17] 2.4G Only
    G24_INT_ADDR_NOT_MATCH        = ( 0x01 << G24_ADDR_NOT_MATCH_SHIFT ), // [16] 2.4G Only

    LLC_INT_TX_FAIL               = ( 0x01 << LLC_TX_FAIL_SHIFT ),              // [15]
    LLC_INT_RX_END                = ( 0x01 << LLC_RX_END_SHIFT ),               // [14]
    LLC_INT_SLEEP_CNT_OVERFLOW    = ( 0x01 << LLC_SLEEP_CNT_OVERFLOW_SHIFT ),   // [13] 
    LLC_INT_RX_LOST               = ( 0x01 << LLC_RX_LOST_SHIFT ),              // [12] 
    
    LLC_INT_RX_CRC_ERRO           = ( 0x01 << LLC_RX_CRC_ERRO_SHIFT ),          // [11] 
    LLC_INT_RX_CRC_OK             = ( 0x01 << LLC_RX_CRC_OK_SHIFT ),            // [10] 
    LLC_INT_TX_END                = ( 0x01 << LLC_TX_END_SHIFT ),               // [09]
    LLC_INT_RX_PRE_IFS            = ( 0x01 << LLC_RX_PRE_IFS_SHIFT ),           // [08] 

    LLC_INT_TX_PRE_IFS            = ( 0x01 << LLC_TX_PRE_IFS_SHIFT ),           // [07] 
    LLC_INT_SLEEP_BEGIN           = ( 0x01 << LLC_SLEEP_BEGIN_SHIFT ),          // [06] 
    LLC_INT_RELOAD_UNDERFLOW      = ( 0x01 << LLC_RELOAD_UNDERFLOW_SHIFT ),     // [05] 
    LLC_INT_RELOAD_OVERFLOW       = ( 0x01 << LLC_RELOAD_OVERFLOW_SHIFT ),      // [04]
    
    LLC_INT_LISEN_END             = ( 0x01 << LLC_LISEN_END_SHIFT ),            // [03] 
    LLC_INT_INTERVAL_END          = ( 0x01 << LLC_INTERVAL_END_SHIFT ),         // [02] 
    LLC_INT_RX_PRE_INTERVAL       = ( 0x01 << LLC_RX_PRE_INTERVAL_SHIFT ),      // [01] 
    LLC_INT_TX_PRE_INTERVAL       = ( 0x01 << LLC_TX_PRE_INTERVAL_SHIFT ),      // [00] 

} EN_LLC_INT_FLAG_T;

#define LLC_ALL_INT_MASK      ( (0x01 << 22) - 1 )


//=====================================================================================================================
// [0x0C](RW) LLC_DATA_RATE
//=====================================================================================================================
//=============================================================================
// LLC_DATA_RATE[3:2] LLC_TX_DATA_RATE Define
#define LLC_TX_DATA_RATE_SHIFT             ( 2 )
#define LLC_TX_DATA_RATE_MSK               ( (0x01 << 2) - 1 )

//=============================================================================
// LLC_DATA_RATE[1:0] LLC_RX_DATA_RATE Define
#define LLC_RX_DATA_RATE_SHIFT             ( 0 )
#define LLC_RX_DATA_RATE_MSK               ( (0x01 << 2) - 1 )

typedef enum
{
    EN_LLC_DATA_RATE_125K = 0x00,
    EN_LLC_DATA_RATE_500K = 0x01,
    EN_LLC_DATA_RATE_1M   = 0x02,
    EN_LLC_DATA_RATE_2M   = 0x03,

    EN_LLC_DATA_RATE_NUMB = 0x04,
    
} EN_LLC_DATA_RATE_T;


//=====================================================================================================================
// [0x10](RW) LLC_CTRL
//=====================================================================================================================
//=============================================================================
// LLC_CTRL[0] LLC_LTC_EN Define 
#define LLC_LTC_EN_MSK                     ( (0x01 << 1) - 1 )
#define LLC_LTC_EN_SHIFT                   ( 0 )

//=============================================================================
// LLC_CTRL[1] LLC_DTM_EN Define
#define LLC_DTM_EN_SHIFT                   ( 1 )
#define LLC_DTM_EN_MSK                     ( (0x01 << 1) - 1 )

//=============================================================================
// LLC_CTRL[2] LLC_DATA_BYPASS_EN Define 
#define LLC_DATA_BYPASS_EN_MSK      (( 0x01 << 1 ) - 1)
#define LLC_DATA_BYPASS_EN_SHIFT    ( 2 )

//=============================================================================
// LLC_CTRL[3] LLC_PNGEN_BYPASS_EN Define 
#define LLC_DATA_WHITEN_EN_SHIFT           ( 3 )
#define LLC_DATA_WHITEN_EN_MSK             ( (0x01 << 1) - 1 )

//=============================================================================
// LLC_CTRL[4] LLC_HOST_EN Define 
#define LLC_HOST_EN_MSK             (( 0x01 << 1 ) - 1)
#define LLC_HOST_EN_SHIFT           ( 4 )

//=============================================================================
// LLC_CTRL[5:6] LLC_HOST_RX_EN Define 
#define LLC_HOST_MODE_SEL_MSK       (( 0x01 << 2 ) - 1)
#define LLC_HOST_MODE_SEL_SHIFT      ( 5 )

