EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_llc.h
typedef enum
{ 
    EN_LLC_HOST_NONE      = 0,
    EN_LLC_HOST_RX_ONLY   = 1,
    EN_LLC_HOST_TX_ONLY   = 2,
    EN_LLC_HOST_TRX       = 3,
} EN_LLC_HOST_MODE_T;


//=====================================================================================================================
// [0x14](RW) LLC_STOP_CTRL
//=====================================================================================================================
//=============================================================================
// LLC_STOP_CTRL[1] LLC_STOP_TRX_EN
#define LLC_STOP_TRX_EN_MSK                ( (0x01 << 1) - 1 )
#define LLC_STOP_TRX_EN_SHIFT              ( 1 )

//=============================================================================
// LLC_STOP_CTRL[0] LLC_WHITE_LIST_FAIL_STOP_EN
#define LLC_WHITE_LIST_FAIL_STOP_EN_MSK    ( (0x01 << 1) - 1 )
#define LLC_WHITE_LIST_FAIL_STOP_EN_SHIFT  ( 0 )


//not confirm with digital designer
//=====================================================================================================================
// [0x18](WO) LLC_TRIG_CTRL
//=====================================================================================================================
//=============================================================================
// LLC_TRIG_CTRL[0] LLC_TRIG_SLEEP  Define
#define LLC_SLEEP_EN_SHIFT                 ( 0 )
#define LLC_SLEEP_EN_MSK                   ( (0x01 << 1) - 1 )

#define LLC_WAKEUP_EN_SHIFT                ( 1 )
#define LLC_WAKEUP_EN_MSK                  ( (0x01 << 1) - 1 )

#define LLC_READ_COUNTER_EN_SHIFT          ( 2 )
#define LLC_READ_COUNTER_EN_MSK            ( (0x01 << 1) - 1 )

#define LLC_RELOAD_INTV_SHIFT              ( 3 )
#define LLC_RELOAD_INTV_MSK                ( (0x01 << 1) - 1 )

#define LLC_SYNC_32K_SHIFT                 ( 4 )
#define LLC_SYNC_32K_MSK                   ( (0x01 << 1) - 1 )

#define LLC_RELOAD_SCH_SHIFT               ( 5 )
#define LLC_RELOAD_SCH_MSK                 ( (0x01 << 1) - 1 )

#define LLC_TRIG_ALL_MSK                   ( (0x01 << 6) - 1 )


//=====================================================================================================================
// [0x1C](RW) LLC_CLK_RATIO_CFG
//=====================================================================================================================
//=============================================================================
// LLC_CLK_RATIO_CFG[0:15] LLC_CLK_RATIO_VAL 
#define LLC_CLK_RATIO_VAL_MSK         (( 0x01 << 16 ) - 1 )
#define LLC_CLK_RATIO_VAL_SHIFT       ( 0 )

#define LLC_CLK_RATIO_INVALIDE_MSK    (( 0x01 << 1 ) - 1 )
#define LLC_CLK_RATIO_INVALIDE_SHIFT  ( 16 )


//=====================================================================================================================
// [0x20](RW) LLC_TX_PDU_HEADER
//=====================================================================================================================
//=============================================================================
// LLC_TX_PDU_HEADER[23:0] LLC_TX_PDU_HEADER
#define LLC_TX_PDU_HEADER_SHIFT            ( 0 )
#define LLC_TX_PDU_HEADER_MSK              ( (0x01 << 24) - 1 )

typedef struct
{
    uint32_t u4BitPduType : 4;  // [3:0] PDU TYPE
    uint32_t u4BitZero    : 4;  // [7:4] Keep to Zero
    uint32_t u8BitLen     : 8;  // [15:8] Length 
    uint32_t u16BitRes    : 16; // [31:16] Reserved

} stTxPduHeader_t, *pstTxPduHeader_t;

typedef struct
{
    uint32_t u4BitPduType : 4;  // [3:0] 
    uint32_t u2BitRFU     : 2;  // [5:4] Reserved for future.
    uint32_t u1BitTxAdd   : 1;  // [6] Tx Add
    uint32_t u1BitRxAdd   : 1;  // [7] Rx Add
    uint32_t u8BitLen     : 8;  // [15:8] Length
    uint32_t u16BitRes    : 16; // [16:31] Reserved
    
} stAdvPduHeader_t, *pstAdvPduHeader_t;

typedef struct
{
    uint32_t u2BitLLID    : 2; // [1:0]
    uint32_t u1BitNESN    : 1; // [2] Next Data package Serial Number
    uint32_t u1BitSN      : 1; // [3] Data Package Serial Number
    uint32_t u1MD         : 1; // [4] MD = 1 means not finished.
    uint32_t u3RFU        : 3; // [7:5] Reserved for future.
    uint32_t u8BitLen     : 8; // [15:8] Length
    uint32_t u8BitCTE     : 8; // [23:16] CTE Info
    uint32_t u8bitRes     : 8; // [31:24] Reserved
    
} stDataPduHeader_t, *pstDataPduHeader_t;

typedef struct
{
    uint32_t u9BitTxLen   : 9;  // [8:0]
    uint32_t u23bitRes    : 23; // [31:9] Reserved
    
} stBypassPduHeader_t, *pstBypassPduHeader_t;

typedef struct
{
    uint32_t u9BitTxLen   : 9;  // [8:0]
    uint32_t u7DevAddr    : 7;  // [15:9]
    uint32_t u16bitRes    : 16; // [31:16] Reserved
    
} st2G4Header_t, *pst2G4Header_t;


//=====================================================================================================================
// [0x24](RW) LLC_RX_PDU_HEADER
//=====================================================================================================================
//=============================================================================
// LLC_RX_PDU_HEADER[7:0] LLC_RX_PDU_MAX_LEN
#define LLC_RX_PDU_MAX_LEN_SHIFT           ( 0 )
#define LLC_RX_PDU_MAX_LEN_MSK             ( (0x01 << 8) - 1 )

typedef struct
{
    uint32_t u8BitRxMaxLen : 8;  // [7:0]
    uint32_t u24bitRes     : 24; // [8:31] Reserved
    
} stRxHeader_t, *pstRxHeader_t;


//=====================================================================================================================
// [0x28](RW) LLC_TRX_CHANNEL_CFG
//=====================================================================================================================
//=============================================================================
// LLC_TRX_CHANNEL_CFG[6] LLC_TRX_CHN_SEL
#define LLC_TRX_CHN_SEL_SHIFT              ( 6 )
#define LLC_TRX_CHN_SEL_MSK                ( (0x01 << 1) - 1 )

typedef enum
{
    EN_LLC_TRX_PRIMARY_CHN   = 0,
    EN_LLC_TRX_SECONDARY_CHN = 1,
    
} EN_LLC_TRX_CHN_SEL_T;

#define IS_VALID_LLC_TRX_CHN_SEL( SEL )  ( ((SEL) == EN_LLC_TRX_PRIMARY_CHN) \
                                        || ((SEL) == EN_LLC_TRX_SECONDARY_CHN) )

