EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_llc.h
//=============================================================================
// LLC_TRX_CHANNEL_CFG[5:0] LLC_TRX_CHN_INDEX
#define LLC_TRX_CHN_INDEX_SHIFT            ( 0 )
#define LLC_TRX_CHN_INDEX_MSK              ( (0x01 << 6) - 1 )
#define LLC_TRX_MAX_CHN_NUMB               ( 39 )


//=====================================================================================================================
// [0x2C](RW) LLC_DATA_CHAN_ACCESS_KEY
//=====================================================================================================================
//=============================================================================
// LLC_DATA_CHAN_ACCESS_KEY[3] LLC_DATA_CHAN_ACCESS_KEY
#define LLC_DATA_CHAN_ACCESS_KEY_SHIFT     ( 0 )
#define LLC_DATA_CHAN_ACCESS_KEY_MSK       ( WORD_MSK )

#define LLC_DATA_CHN_ACCESS_KEY            ( 0x8E89BED6 )


//=====================================================================================================================
// [0x34] (RW) LLC_BLE_CFG
//=====================================================================================================================
//=============================================================================
// LLC_BLE_CFG[3] LLC_RX_PDU_TYPE
#define LLC_RX_PDU_TYPE_SHIFT              ( 3 )
#define LLC_RX_PDU_TYPE_MSK                ( (0x01 << 1) - 1 )

typedef enum
{ 
    EN_LLC_RX_TONE_END  = 0,
    EN_LLC_RX_PDU_END   = 1,

} EN_LLC_RX_PDU_TYPE_T;

//=============================================================================
// LLC_BLE_CFG[2:0] LLC_WORK_MODE
#define LLC_WORK_MODE_SHIFT                ( 0 )
#define LLC_WORK_MODE_MSK                  ( (0x01 << 3) - 1 )

typedef enum
{
    EN_LLC_IDLE     = 0x00,
    EN_LLC_ADV      = 0x01,
    EN_LLC_SCAN     = 0x02,
    EN_LLC_INIT     = 0x03,
    EN_LLC_SLAVE    = 0x04,
    EN_LLC_MASTER   = 0x05,

} EN_LLC_WORK_MODE_T;

typedef struct
{
    uint32_t u3BitWorkMode : 3;  // [2:0]
    uint32_t u1BitRxPdu    : 1;  // [3]
    uint32_t u28bitRes     : 28; // [4:31] Reserved
    
} stLlcBleCfg_t, *pstLlcBleCfg_t;


//=====================================================================================================================
// [0x38] (RW) LLC_BLE_CTRL
//=====================================================================================================================
#define LLC_ACTIVE_SCAN_EN_MSK            (( 0x01 << 1 ) - 1 )
#define LLC_ACTIVE_SCAN_EN_SHIFT          ( 0 )

#define LLC_RECV_RES_PACKET_EN_MSK        (( 0x01 << 1 ) - 1 )
#define LLC_RECV_RES_PACKET_EN_SHIFT      ( 1 )

#define LLC_CHK_EXPECT_PACKET_EN_MSK      (( 0x01 << 1 ) - 1 )
#define LLC_CHK_EXPECT_PACKET_EN_SHIFT    ( 2 )


//=====================================================================================================================
// [0x3C] (RW)LLC_P2G4_CFG
//=====================================================================================================================
#define LLC_P2G4_WORK_MODE_MSK            (( 0x01 << 3 ) - 1 )
#define LLC_P2G4_WORK_MODE_SHIFT          ( 0 )

typedef enum
{
    EN_P2G4_TX_RX       = 0,
    EN_P2G4_TX_ONCE     = 1,
    EN_P2G4_TX_CONTINUE = 2,
    EN_P2G4_RX_TX       = 4,
    EN_P2G4_RX_ONCE     = 5,

} EN_P2G4_WORK_MODE_T;



//=====================================================================================================================
// [0x40] (RW)LLC_P2G4_CTRL  2G4 only
//=====================================================================================================================
#define LLC_P2G4_CSMA_EN_MSK          (( 0x01 << 1 ) - 1 )
#define LLC_P2G4_CSMA_EN_SHIFT        ( 0 )

#define LLC_P2G4_AUTO_STOP_EN_MSK     (( 0x01 << 1 ) - 1 )
#define LLC_P2G4_AUTO_STOP_EN_SHIFT   ( 1 )

#define LLC_P2G4_STOP_EN_MSK          (( 0x01 << 1 ) - 1 )
#define LLC_P2G4_STOP__EN_SHIFT       ( 2 )


#define LLC_P2G4_REPEAT_EN_MSK        (( 0x01 << 1 ) - 1 )
#define LLC_P2G4_REPEAT__EN_SHIFT     ( 3 )


//=====================================================================================================================
// [0x44] (RW) LLC_P2G4_CSMA_CFG;       P2G4 Only 
//=====================================================================================================================
#define LLC_P2G4_CSMA_LEN_MSK          (( 0x01 << 16 ) - 1 )
#define LLC_P2G4_CSMA_LEN_SHIFT        ( 0 )

#define LLC_P2G4_CSMA_TIMEOUT_MSK      (( 0x01 << 16 ) - 1 )
#define LLC_P2G4_CSMA_TIMEOUT_SHIFT    ( 16 )

//=====================================================================================================================

// [0x48] (WO) LLC_P2G4_TRIG_CTRL
//=====================================================================================================================
#define LLC_P2G4_START_MSK          (( 0x01 << 1 ) - 1 )
#define LLC_P2G4_START_SHIFT        ( 1 )

#define LLC_P2G4_READY_MSK          (( 0x01 << 1 ) - 1 )
#define LLC_P2G4_READY_SHIFT        ( 0 )


//=====================================================================================================================
// [0x4C] (RW) LLC_CRC_INIT_VAL
//=====================================================================================================================
//=============================================================================
// LLC_CRC_INIT_VAL[23:0] LLC_CRC_INIT_VAL
#define LLC_CRC_INIT_VAL_SHIFT             ( 0 )
#define LLC_CRC_INIT_VAL_MSK               ( (0x01 << 24) - 1 )

#define LLC_CRC_INIT_VALUE                 ( 0x00555555 )


//=====================================================================================================================
// [0x50] (RW) LLC_CRC_CFG
//=====================================================================================================================
#define LLC_CRC_BITS_CFG_MSK       (( 0x01 << 2 ) - 1 )
#define LLC_CRC_BITS_CFG_SHIFT     ( 0 )

typedef enum
{
    EN_CRC_24BIT   = 0,
    EN_CRC_23BIT   = 1,    // LSB[0] invalid
    EN_CRC_22BIT   = 2,    // LSB[0:1] invalid
    
