EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_llc.h
} EN_CRC_BITS_T;


//=====================================================================================================================
// [0x54] (RW) LLC_CRC_READ_CFG
//=====================================================================================================================
#define LLC_CRC_READ_CFG_MSK        (( 0x01 << 2 ) - 1 )
#define LLC_CRC_READ_CFG_SHIFT      ( 0 )

typedef enum
{
    EN_CRC_READ_AFTER_WHITEN = 1,
    EN_CRC_READ_AFTER_CRC    = 0,

} EN_CRC_READ_CFG_T;


//=====================================================================================================================
// [0x58] (RW) LLC_SLEEP_PERIOD; unit : 8K/16K/32K
//=====================================================================================================================
//=============================================================================
// LLC_SLEEP_PERIOD[28:0] LLC_SLEEP_PERIOD
#define LLC_SLEEP_PERIOD_SHIFT             ( 0 )
#define LLC_SLEEP_PERIOD_MSK               ( (0x01 << 29) - 1 )


//=====================================================================================================================
// [0x5C] (RW) LLC_SLP_ACT_CONVERT_CNT; unit : 8K/16K/32K
//=====================================================================================================================

#define LLC_SLP_ACT_CONVERT_CNT_MSK      (( 0x01 << 29 ) - 1 )
#define LLC_SLP_ACT_CONVERT_CNT_SHIFT    ( 0 )


typedef enum
{
    EN_LLC_SLEEP_CLK_UINT_8K  = 0x00,
    EN_LLC_SLEEP_CLK_UINT_16K = 0x01,
    EN_LLC_SLEEP_CLK_UINT_32K = 0x02,
    
} EN_SLEEP_CLK_UNIT_T;

//=====================================================================================================================
// [0x60][0x64] (RW) LLC_INTV_PERIOD_HI / LLC_INTV_PERIOD_LO unit : 16mHz
//=====================================================================================================================
//=============================================================================
// LLC_INTV_PERIOD_HI[5:0] LLC_INTV_PERIOD_HI Define
#define LLC_INTV_PERIOD_HI_SHIFT           ( 0 )
#define LLC_INTV_PERIOD_HI_MSK             ( (0x01 << 6) - 1 )

//=============================================================================
// LLC_INTV_PERIOD_LO[31:0] LLC_INTV_PERIOD_LO Define
#define LLC_INTV_PERIOD_LO_SHIFT           ( 0 )
#define LLC_INTV_PERIOD_LO_MSK             ( WORD_MSK )


//=====================================================================================================================
// [0x68~0x6C] (RW) LLC_INTV_RELOAD_DELTA_HI/LLC_INTV_RELOAD_DELTA_LO, unit is 16MHz
//=====================================================================================================================
//=============================================================================
// LLC_INTV_RELOAD_DELTA_HI[6] LLC_INTV_RELOAD_MODE Define
#define LLC_INTV_RELOAD_MODE_SHIFT         ( 6 )
#define LLC_INTV_RELOAD_MODE_MSK           ( (0x01 << 1) - 1 )

typedef enum
{
    EN_LLC_INTV_RELOAD_MINUS  = 0,
    EN_LLC_INTV_RELOAD_PLUS   = 1,
    
} EN_LLC_INTV_RELOAD_MODE_T;

//=============================================================================
// LLC_INTV_RELOAD_DELTA_HI[5:0] LLC_INTV_RELOAD_HI Define
#define LLC_INTV_RELOAD_HI_SHIFT           ( 0 )
#define LLC_INTV_RELOAD_HI_MSK             ( (0x01 << 6) - 1 )

//=============================================================================
// LLC_INTV_RELOAD_DELTA_LO[31:0] LLC_INTV_RELOAD_LO Define
#define LLC_INTV_RELOAD_LO_SHIFT           ( 0 )
#define LLC_INTV_RELOAD_LO_MSK             ( WORD_MSK )


//=====================================================================================================================
// [0x70][0x74] (RW) LLC_INTV_PERIOD_MAX_HI /LLC_INTV_PERIOD_MAX_LO unit : 16mHz
//=====================================================================================================================
#define LLC_INTV_PERIOD_MAX_HI_MSK      (( 0x01u << 6 ) - 1 )
#define LLC_INTV_PERIOD_MAX_HI_SHIFT    ( 0 )

#define LLC_INTV_PERIOD_MAX_LO_MSK      ( WORD_MSK )
#define LLC_INTV_PERIOD_MAX_LO_SHIFT    ( 0 )


//=====================================================================================================================
// [0x78][0x7C] (RW) LLC_INTV_PERIOD_MIN_HI /LLC_INTV_PERIOD_MIN_LO unit : 16mHz
//=====================================================================================================================
#define LLC_INTV_PERIOD_MIN_HI_MSK      (( 0x01u << 6 ) - 1 )
#define LLC_INTV_PERIOD_MIN_HI_SHIFT    ( 0 )

#define LLC_INTV_PERIOD_MIN_LO_MSK      ( WORD_MSK )
#define LLC_INTV_PERIOD_MIN_LO_SHIFT    ( 0 )
 

//=====================================================================================================================
// [0x80] (RW) LLC_IFS_TIME_CFG unit : 16mHz
//=====================================================================================================================
//=============================================================================
// LLC_IFS_TIME_CFG[31:16] LLC_RX_IFS_TIME, Default: 0x8C8
#define LLC_RX_IFS_TIME_SHIFT              ( 16 )
#define LLC_RX_IFS_TIME_MSK                ( (0x01 << 16) - 1 )

//=============================================================================
// LLC_IFS_TIME_CFG[15:0] LLC_TX_IFS_TIME, Default: 0x8A0
#define LLC_TX_IFS_TIME_SHIFT              ( 0 )
#define LLC_TX_IFS_TIME_MSK                ( (0x01 << 16) - 1 )


//=====================================================================================================================
// [0x84] (RW) LLC_IFS_WINDOW_CFG unit : 16mHz, defualt : 0x4B0
//=====================================================================================================================
//=============================================================================
// LLC_IFS_WINDOW_CFG[15:0] LLC_RX_IFS_WINDOW, Default: 0x4B0
#define LLC_RX_IFS_WINDOW_SHIFT            ( 0 )
#define LLC_RX_IFS_WINDOW_MSK              ( (0x01 << 16) - 1 )


