EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_llc.h
//=====================================================================================================================
// [0x88][0x8C] (RW) LLC_LISTEN_BEGIN_HI / LLC_LISTEN_BEGIN_LO, unit: 16mHz
//=====================================================================================================================
//=============================================================================
// LLC_LISTEN_BEGIN_HI[5:0] LLC_LISTEN_BEGIN_HI Define
#define LLC_LISTEN_BEGIN_HI_SHIFT          ( 0 )
#define LLC_LISTEN_BEGIN_HI_MSK            ( (0x01 << 6) - 1 )

//=============================================================================
// LLC_LISTEN_BEGIN_LO[31:0] LLC_LISTEN_BEGIN_LO Define
#define LLC_LISTEN_BEGIN_LO_SHIFT          ( 0 )
#define LLC_LISTEN_BEGIN_LO_MSK            ( WORD_MSK )


//=====================================================================================================================
// [0x90][0x94] (RW) LLC_LISTEN_END_HI / LLC_LISTEN_END_LO unit : 16mHz
//=====================================================================================================================
//=============================================================================
// LLC_LISTEN_END_HI[5:0] LLC_LISTEN_END_HI Define
#define LLC_LISTEN_END_HI_SHIFT            ( 0 )
#define LLC_LISTEN_END_HI_MSK              ( (0x01 << 6) - 1 )

//=============================================================================
// LLC_LISTEN_END_LO[31:0] LLC_LISTEN_END_LO Define
#define LLC_LISTEN_END_LO_SHIFT            ( 0 )
#define LLC_LISTEN_END_LO_MSK              ( WORD_MSK )


//=====================================================================================================================
// [0x98][0x9C] (RW) LLC_RX_STOP_TIME_HI / LLC_RX_STOP_TIME_LO unit : 16mHz
//=====================================================================================================================
#define LLC_RX_STOP_TIME_HI_MSK        (( 0x01 << 6 ) - 1 )
#define LLC_RX_STOP_TIME_HI_SHIFT      ( 0 )

#define LLC_RX_STOP_TIME_LO_MSK        ( WORD_MSK )
#define LLC_RX_STOP_TIME_LO_SHIFT      ( 0 )


//=====================================================================================================================
// [0xA0](RW) LLC_INTV_PRE_TIME_CFG unit : 16mHz
//=====================================================================================================================
#define LLC_INTV_RX_PRE_TIME_MSK      (( 0x01u << 13 ) - 1 )
#define LLC_INTV_RX_PRE_TIME_SHIFT    ( 0 )

#define LLC_INTV_TX_PRE_TIME_MSK      (( 0x01u << 13 ) - 1 )
#define LLC_INTV_TX_PRE_TIME_SHIFT    ( 13 )


//=====================================================================================================================
// [0xA4][0xA8](RW) LLC_TRX_STOP_TIME_HI / LLC_TRX_STOP_TIME_LO unit : 16mHz
//=====================================================================================================================
//=============================================================================
// LLC_TRX_STOP_TIME_HI[5:0] LLC_TRX_STOP_TIME_HI Define
#define LLC_TRX_STOP_TIME_HI_SHIFT         ( 0 )
#define LLC_TRX_STOP_TIME_HI_MSK           ( (0x01 << 6) - 1 )

//=============================================================================
// LLC_TRX_STOP_TIME_LO[31:0] LLC_TRX_STOP_TIME_LO Define
#define LLC_TRX_STOP_TIME_LO_SHIFT         ( 0 )
#define LLC_TRX_STOP_TIME_LO_MSK           ( WORD_MSK )


//=====================================================================================================================
// [0xAC] (RW) LLC_IFS_PRE_TIME_CFG unit : 16mHz
//=====================================================================================================================

#define LLC_IFS_RX_PRE_TIME_MSK       (( 0x01u << 13 ) - 1 )
#define LLC_IFS_RX_PRE_TIME_SHIFT     ( 0 )

#define LLC_IFS_TX_PRE_TIME_MSK       (( 0x01u << 13 ) - 1 )
#define LLC_IFS_TX_PRE_TIME_SHIFT     ( 13 )


//=====================================================================================================================
// [0xB0] (RW) LLC_CCM_PREPARE_TIME_CFG unit : 16mHz
//=====================================================================================================================

#define LLC_RX_CCM_PREPARE_TIME_MSK      (( 0x01u << 16 ) - 1 )
#define LLC_RX_CCM_PREPARE_TIME_SHIFT    ( 0 )

#define LLC_TX_CCM_PREPARE_TIME_MSK      (( 0x01u << 16 ) - 1 )
#define LLC_TX_CCM_PREPARE_TIME_SHIFT    ( 16 )



//=====================================================================================================================
// [0xB4] (RW) LLC_RADIO_TURNON_PRE_TIME_CFG unit : 16mHz
//=====================================================================================================================
//=============================================================================
// LLC_RADIO_TURNON_PRE_TIME_CFG[28:16] LLC_TXRADIO_TURNON_PRE_TIME Define
#define LLC_TXRADIO_TURNON_PRE_TIME_SHIFT  ( 13 )
#define LLC_TXRADIO_TURNON_PRE_TIME_MSK    ( (0x01 << 13) - 1 )

//=============================================================================
// LLC_RADIO_TURNON_PRE_TIME_CFG[12:0] LLC_RXRADIO_TURNON_PRE_TIME Define
#define LLC_RXRADIO_TURNON_PRE_TIME_SHIFT  ( 0 )
#define LLC_RXRADIO_TURNON_PRE_TIME_MSK    ( (0x01 << 13) - 1 )

typedef struct
{
    uint32_t u13RxPreTime : 13;
    uint32_t u3Reserved0  : 3;
    uint32_t u13TxPreTime : 13;
    uint32_t u3Reserved1  : 3;
    
} stRadioPreTime_t;

typedef union
{
    uint32_t          u32RadioPreTime;
    stRadioPreTime_t  stRadioPreTime;
    
}unRadioPreTime_t;



//=====================================================================================================================
// [0xB8] (RW) LLC_RADIO_TURNOFF_TIME_CFG unit : 16mHz
//=====================================================================================================================
#define LLC_RXRADIO_TURNOFF_TIME_MSK          (( 1u << 12 ) - 1 )
#define LLC_RXRADIO_TURNOFF_TIME_SHIFT        ( 0 )


#define LLC_TXRADIO_TURNOFF_TIME_MSK          (( 1u << 12 ) - 1 )
#define LLC_TXRADIO_TURNOFF_TIME_SHIFT        ( 12 )


