EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_llc.h
//=====================================================================================================================
// [0xC0] (RW) LLC_INTERRUPT_DELAY_CFG unit : 16mHz
//=====================================================================================================================

#define LLC_TX_END_INT_DELAY_MSK            (( 0x01u << 8 ) - 1 )
#define LLC_TX_END_INT_DELAY_SHIFT          ( 0 )

#define LLC_RX_PDU_END_INT_DELAY_MSK        (( 0x01u << 8 ) - 1 )
#define LLC_RX_PDU_END_INT_DELAY_SHIFT      ( 8 )

#define LLC_RX_END_INT_DELAY_MSK            (( 0x01u << 8 ) - 1 )
#define LLC_RX_END_INT_DELAY_SHIFT          ( 16 )




//=====================================================================================================================
// [0xC4][0xC8] (RW) LLC_INIT_ADDR_HI / LLC_INIT_ADDR_LO
//=====================================================================================================================

#define LLC_INIT_ADDR_HI_MSK             (( 0x01u << 16 ) - 1 )
#define LLC_INIT_ADDR_HI_SHIFT           ( 0 )

#define LLC_INIT_ADDR_LO_MSK             ( WORD_MSK )
#define LLC_INIT_ADDR_LO_SHIFT           ( 0 )


//=====================================================================================================================
// [0xCC][0xD0] (RW) LLC_ADV_ADDR_HI / LLC_ADV_ADDR_LO
//=====================================================================================================================
#define LLC_ADV_ADDR_HI_MSK             (( 0x01u << 16 ) - 1 )
#define LLC_ADV_ADDR_HI_SHIFT           ( 0 )

#define LLC_ADV_ADDR_LO_MSK             ( WORD_MSK )
#define LLC_ADV_ADDR_LO_SHIFT           ( 0 )



//=====================================================================================================================
// [0xD4] (RW) LLC_ADV_DIRECT_IND_CFG
//=====================================================================================================================
#define LLC_ADV_DIRECT_IND_ADVA_MATCH_EN_MSK      (( 0x01u << 1 ) - 1 )
#define LLC_ADV_DIRECT_IND_ADVA_MATCH_EN_SHIFT    ( 0 )

#define LLC_ADV_DIRECT_IND_INITA_MATCH_EN_MSK      (( 0x01u << 1 ) - 1 )
#define LLC_ADV_DIRECT_IND_INITA_MATCH_EN_SHIFT    ( 1 )



#define LLC_ADV_DIRECT_IND_MATCH_ADDR_MSK      (( 0x01u << 2 ) - 1 )
#define LLC_ADV_DIRECT_IND_MATCH_ADDR_SHIFT    ( 0 )

typedef enum
{
  EN_ADV_DIRCT_IND_MATCH_NONE       = 0,
  EN_ADV_DIRCT_IND_MATCH_ADVA       = 1,
  EN_ADV_DIRCT_IND_MATCH_INITA      = 2,
  EN_ADV_DIRCT_IND_MATCH_ADVA_INITA = 3,

} EN_ADV_DIRCT_IND_ADDR_MATCH_T;

//=====================================================================================================================
// [0xE0] (RW) LTC_WORK_STATE; 
//=====================================================================================================================
#define LTC_WORK_STA_MSK       (( 1U << 1 ) - 1 )
#define LTC_WORK_STA_SHIFT     ( 0 )

typedef enum
{
    EN_LTC_WORK_STA_ACTIVE = 0,
    EN_LTC_WORK_STA_SLEEP  = 1,

} EN_LTC_WORK_STA_T;

//=====================================================================================================================
// [0xE8] (RO) LLC_TX_EX_ADV_STA; 
//=====================================================================================================================

#define LLC_TX_EX_ADV_LEN_MSK      (( 0x01 << 6 ) - 1 )
#define LLC_TX_EX_ADV_LEN_SHIFT    ( 0 )

#define LLC_EX_ADV_MODE_MSK        (( 0x01 << 2 ) - 1 )
#define LLC_EX_ADV_MODE_SHIFT      ( 6 )

typedef enum
{
    EN_EX_ADV_NONE_CONN_NONE_SCAN  = 0,
    EN_EX_ADV_CONN_NONE_SCAN       = 1,
    EN_EX_ADV_NONE_CONN_SCAN       = 2,
} EN_EX_ADV_MODE_T;


//=====================================================================================================================
// [0xF0] (RO) LLC_RX_STA; 
//=====================================================================================================================
//=============================================================================
// LLC_RX_STA[9:8] LLC_RX_CI
#define LLC_RX_CI_SHIFT                    ( 8 )
#define LLC_RX_CI_MSK                      ( (0x01 << 2) - 1 )

typedef enum
{
    EN_LLC_RX_CI_S_8  = 0,
    EN_LLC_RX_CI_S_2  = 1,
    
} EN_LLC_RX_CI_T;






//=====================================================================================================================
// LLC_RX_STA[7:6] LLC_RX_CI
#define LLC_EXT_ADV_MODE_MSK    (( 0x01 << 2) - 1 )
#define LLC_EXT_ADV_MODE_SHIFT  ( 6 )

typedef enum
{
    EN_NON_CONN_NON_SCAN_MODE = 0x00,
    EN_CONN_NON_SCAN_MODE     = 0x01,
    EN_NON_CONN_SCAN_MODE     = 0x02
    
} EN_LLC_RX_EXT_ADV_MODE_T;

//=====================================================================================================================
// LLC_RX_STA[7:6] LLC_EXT_HEADER_LEN
#define LLC_EXT_HEADER_LEN_MSK    (( 0x01 << 5 ) - 1 )
#define LLC_EXT_HEADER_LEN_SHIFT  ( 0 )


//=====================================================================================================================
// [0xF8] (RO) LLC_RX_HEADER_VAL
//=====================================================================================================================
//=============================================================================
// LLC_RX_HEADER_VAL[15:0] LLC_RX_HEADER
#define LLC_RX_HEADER_SHIFT                ( 0 )
#define LLC_RX_HEADER_MSK                  ( (0x01 << 16) - 1 )


//=====================================================================================================================
// [0x110~0x114] (RO) LLC_INTV_ACT_CNT_HI / LLC_INTV_ACT_CNT_LO
//=====================================================================================================================
//=============================================================================
// LLC_INTV_ACT_CNT_HI[5:0] LLC_INTV_ACT_CNT_HI Define
#define LLC_INTV_ACT_CNT_HI_SHIFT          ( 0 )
#define LLC_INTV_ACT_CNT_HI_MSK            ( (0x01 << 6) - 1 )

//=============================================================================
// LLC_INTV_ACT_CNT_LO[31:0] LLC_INTV_ACT_CNT_LO Define
#define LLC_INTV_ACT_CNT_LO_SHIFT          ( 0 )
#define LLC_INTV_ACT_CNT_LO_MSK            ( WORD_MSK )

