EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_llc.h
//=====================================================================================================================
// [0x118~0x11C] (RO) LLC_INTV_ACT_TRIG_CNT_HI / LLC_INTV_ACT_TRIG_CNT_LO
//=====================================================================================================================
//=============================================================================
// LLC_INTV_ACT_TRIG_CNT_HI[5:0] LLC_INTV_ACT_TRIG_CNT_HI Define
#define LLC_INTV_ACT_TRIG_CNT_HI_SHIFT          ( 0 )
#define LLC_INTV_ACT_TRIG_CNT_HI_MSK            ( (0x01 << 6) - 1 )

//=============================================================================
// LLC_INTV_ACT_TRIG_CNT_LO[31:0] LLC_INTV_ACT_CNT_LO Define
#define LLC_INTV_ACT_TRIG_CNT_LO_SHIFT          ( 0 )
#define LLC_INTV_ACT_TRIG_CNT_LO_MSK            ( WORD_MSK )


//=====================================================================================================================
// [0x124][RO] LLC_IFS_TRIG_CNT
//=====================================================================================================================
//=============================================================================
// LLC_IFS_TRIG_CNT[16:0] LLC_IFS_TRIG_CNT Define
#define LLC_IFS_TRIG_CNT_SHIFT           ( 0 )
#define LLC_IFS_TRIG_CNT_MSK             ( (0x01 << 17) - 1 )


//=====================================================================================================================
// [0x128~0x12C] (RO) LLC_SCH_ACT_CNT_HI / LLC_SCH_ACT_CNT_LO
//=====================================================================================================================
//=============================================================================
// LLC_SCH_ACT_CNT_HI[5:0] LLC_SCH_ACT_CNT_HI Define
#define LLC_SCH_ACT_CNT_HI_SHIFT           ( 0 )
#define LLC_SCH_ACT_CNT_HI_MSK             ( (0x01 << 6) - 1 )

//=============================================================================
// LLC_SCH_ACT_CNT_LO[31:0] LLC_SCH_ACT_CNT_LO Define
#define LLC_SCH_ACT_CNT_LO_SHIFT           ( 0 )
#define LLC_SCH_ACT_CNT_LO_MSK             ( WORD_MSK )

//=====================================================================================================================
// [0x130~0x134] (RO) LLC_SCH_ACT_TRIG_CNT_HI / LLC_SCH_ACT_TRIG_CNT_LO
//=====================================================================================================================
//=============================================================================
// LLC_SCH_ACT_TRIG_CNT_HI[5:0] LLC_SCH_ACT_TRIG_CNT_HI Define
#define LLC_SCH_ACT_TRIG_CNT_HI_SHIFT           ( 0 )
#define LLC_SCH_ACT_TRIG_CNT_HI_MSK             ( (0x01 << 6) - 1 )

//=============================================================================
// LLC_SCH_ACT_TRIG_CNT_LO[31:0] LLC_SCH_ACT_TRIG_CNT_LO Define
#define LLC_SCH_ACT_TRIG_CNT_LO_SHIFT           ( 0 )
#define LLC_SCH_ACT_TRIG_CNT_LO_MSK             ( WORD_MSK )


//=====================================================================================================================
// [0x138](RO) LLC_SLEEP_CNT
//=====================================================================================================================
//=============================================================================
// LLC_SLEEP_CNT[28:0] LLC_SLEEP_CNT Define
#define LLC_SLEEP_CNT_SHIFT                ( 0 )
#define LLC_SLEEP_CNT_MSK                  ( (0x01 << 29) - 1 )


#ifdef __cplusplus
}
#endif

#endif /* __REG_LLC_H__ */


